xiaocainiao11111/x_track_learn/template/Keil.AT32F4xx_DFP.1.3.7/SVD/AT32F415xx.svd
      </registers>
    </peripheral>
	<peripheral>
      <name>COMP</name>
      <description>Compare</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>COMP1</name>
        <description>COMP1 interrupt</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>COMP2</name>
        <description>COMP2 interrupt</description>
        <value>71</value>
      </interrupt>	  
      <registers>
        <register>
          <name>COMP_CTRLSTS1</name>
          <displayName>COMP_CTRLSTS1</displayName>
          <description>Comp1 control/status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMP1EN</name>
              <description>Comparator 1 enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP1SW1</name>
              <description>Comparator 1 non inverting input DAC switch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP1MDE</name>
              <description>Comparator 1 mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
			<field>
              <name>COMP1INNSEL</name>
              <description>Comparator 1 inverting input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP1OUTSEL</name>
              <description>Comparator 1 output selection bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP1POLSEL</name>
              <description>Comparator 1 polarity selection bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
			<field>
              <name>COMP1HYST</name>
              <description>Comparator 1 hysteresis bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP1VAL</name>
              <description>Comparator 1 output status bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>			
			<field>
              <name>COMP1LOCK</name>
              <description>COMP_CSR1[15:0] and COMP_CSR2[15:0] register lock bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2EN</name>
              <description>Comparator 2 enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2MDE</name>
              <description>Comparator 2 mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2INNSEL</name>
              <description>Comparator 2 inverting input selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>WMEN</name>
              <description>Window mode enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2OUTSEL</name>
              <description>Comparator 2 output selection bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2POLSEL</name>
              <description>Comparator 2 polarity selection bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2HYST</name>
              <description>Comparator 2 hysteresis bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>			
			<field>
              <name>COMP2VAL</name>
              <description>Comparator 2 output status bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>COMP2LOCK</name>
              <description>COMP_CSR1[31:16] and COMP_CSR2 register lock bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_CTRLSTS2</name>
          <displayName>COMP_CTRLSTS2</displayName>
          <description>Comp2 control/status register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMP1INPSEL</name>
              <description>Comparator 1 non-inverting input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2INPSEL</name>
              <description>Comparator 2 non-inverting input selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>		
        <register>
          <name>G_FILTER_EN</name>
          <displayName>G_FILTER_EN</displayName>
          <description>G_FILTER_EN</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>GFE</name>
              <description>Glitch filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH_PULSE</name>
          <displayName>HIGH_PULSE</displayName>
          <description>HIGH_PULSE</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>H_PULSE_CNT</name>
              <description>High pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>LOW_PULSE</name>
          <displayName>LOW_PULSE</displayName>
          <description>LOW_PULSE</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>L_PULSE_CNT</name>
              <description>Low pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
