xiaocainiao11111/x_track_learn/template/Keil.AT32F4xx_DFP.1.3.7/SVD/AT32F415xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DT</name>
          <displayName>DR</displayName>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDT</name>
          <displayName>IDT</displayName>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDR</name>
              <description>Independent Data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EFC</name>
      <description>EFC</description>
      <groupName>EFC</groupName>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EFLASH</name>
        <description>EFlash global interrupt</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>ACR</name>
          <displayName>ACR</displayName>
          <description>Flash access control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>Latency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLFCYA</name>
              <description>Flash half cycle access
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRFTBE</name>
              <description>Prefetch buffer enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRFTBS</name>
              <description>Prefetch buffer status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCKEY</name>
          <displayName>FCKEY</displayName>
          <description>Flash key register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>FPEC key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPT2KEYR</name>
          <displayName>OTP2KEYR</displayName>
          <description>Flash option key register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OTP2KEY</name>
              <description>Option byte key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STS</name>
          <displayName>STS</displayName>
          <description>Status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRCDN</name>
              <description>End of operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRPRTFLR</name>
              <description>Write protection error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRGMFLR</name>
              <description>Programming error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSY</name>
              <description>Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>Control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>PRGM</name>
              <description>Programming</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPERS</name>
              <description>Mass Erase</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UOBPRGM</name>
              <description>Option byte programming</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UOBERS</name>
              <description>Option byte erase</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTR</name>
              <description>Start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UOBWE</name>
              <description>Option bytes write enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRCDNIE</name>
              <description>End of operation interrupt
              enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDPL2_DIS</name>
              <description>Trigger HW to erase OTP2 when RDP level 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <displayName>ADDR</displayName>
          <description>Flash address register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TA</name>
              <description>Flash Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UOB</name>
          <displayName>UOB</displayName>
          <description>Option byte register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x03FFFFFC</resetValue>
          <fields>
            <field>
              <name>UOBFLR</name>
              <description>Option byte error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDPRTEN</name>
              <description>Read protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDG_SW</name>
              <description>WDG_SW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>nSTP_RST</name>
              <description>nSTP_RST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>nSTDBY_RST</name>
              <description>nSTDBY_RST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USER_D0</name>
              <description>USER_D0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>USER_D1</name>
              <description>USER_D1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RDPRT_HL</name>
              <description>RDP High level</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPRT</name>
          <displayName>WRPRT</displayName>
          <description>Write protection register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>WRPRTBMP</name>
              <description>Write protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSLIB_STS0</name>
          <displayName>FSLIB_STS0</displayName>
          <description>Flash SLIB configuration data0 Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPT3_BOOT_DIS</name>
              <description>Boot mode disable in system memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPT3_SLIB_EN</name>
              <description>Slib code enable in system memory</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSLIB_EN</name>
              <description>Slib code enable in flash</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SYS_SLIB_DAT_PAGE</name>
              <description>Slib data page in system memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSLIB_STS1</name>
          <displayName>FSLIB_STS1</displayName>
          <description>Flash SLIB configuration 
		  data1 Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>BLK_SLIB_ST_PG</name>
              <description>The SLIB code start 
			  address in main block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
			<field>
              <name>BLK_SLIB_DAT_PG</name>
              <description>The SLIB data code 
			  start address in main block</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
			<field>
              <name>BLK_SLIB_END_PG</name>
              <description>The SLIB code end 
			  address in main block</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>        
        <register>
          <name>FSLIB_PSW_CLR</name>
          <displayName>FSLIB_PSW_CLR</displayName>
          <description>Flash SLIB PASSWORD Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>FSLIB_PSW</name>
              <description>SLIB password register, used to 
			  disable SLIB code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSLIB_PSW_STS</name>
          <displayName>FSLIB_PSW_STS</displayName>
          <description>Flash SLIB PASSWORD status 
		  Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLIB_PSW_ERR</name>
              <description>Password mismatch, and password
			  is not equal to 0xFFFFFFFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLIB_PSW_OK</name>
              <description>Password match, and password 
			  is not equal to 0xFFFFFFFF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_AR</name>
          <displayName>CRC_AR</displayName>
          <description>Flash CRC data start Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FCRC_ADDR</name>
              <description>The CRC32 verification start address of user code or SLIB code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_CTRL</name>
          <displayName>CRC_CTRL</displayName>
          <description>Flash CRC Controll Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_NUM</name>
              <description>Data number for CRC calculation. Unit: sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_CHK_TRIG</name>
              <description>Trigger to calculate CRC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_OUTR</name>
          <displayName>CRC_OUTR</displayName>
          <description>Flash CRC verification output Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FCRC_OUT</name>
              <description>CRC32 verification result of flash user code or SLIB code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSLIB_SET_PSW</name>
          <displayName>FSLIB_SET_PSW</displayName>
          <description>Flash SET SLIB PASSWORD 
		  Register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSLIB_SET_PSW</name>
              <description>Flash SET SLIB PASSWORD 
		      Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
        <register>
          <name>FSLIB_SET_RANGE</name>
          <displayName>FSLIB_SET_RANGE</displayName>
          <description>Flash SET SLIB RANGE 
		  Register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSLIB_SET_START_PAGE</name>
              <description>The SLIB code start 
			  address in main block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
			<field>
              <name>FSLIB_SET_DATA_START_PAGE</name>
              <description>The SLIB data code 
			  start address in main block</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
			<field>
              <name>FSLIB_SET_DATA_END_PAGE</name>
              <description>The SLIB code end 
			  address in main block</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>	
        <register>
          <name>SYS_SLIB_SET</name>
          <displayName>SYS_SLIB_SET</displayName>
          <description>SYSTEM MEMORY SET SLIB 
		  Register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
		  <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYS_AS_SLIB</name>
              <description>Configure SYSTEM 
			  MEMORY AS SLIB AREA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
			<field>
              <name>SYS_SET_DATA_START_PAGE</name>
              <description>Slib data start 
			  page in system memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>	
		<register>
          <name>SYS_BOOT_DIS_SET</name>
          <displayName>SYS_BOOT_DIS_SET</displayName>
          <description>SYSTEM MEMORY BOOT 
		  DIS SET Register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
		  <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_DIS_SET</name>
              <description>DISABLE SYSTEM 
			  MEMORY BOOT MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>	
		<register>
          <name>FSLIB_KEYR</name>
          <displayName>FSLIB_KEYR</displayName>
          <description>Flash SLIB KEY 
		  Register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
		  <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSLIB_KEYR</name>
              <description>Write 0xA35F_6D24 to unlock
			  SLIB_SET_PSW SLIB_SET_RANGE SYS_SLIB_SET 
			  SYS_BOOT_DIS_SET registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>			
